library(rvest)
library(xml2)
library(dplyr)
library(tidyr)
library(httr)
library(magrittr)
library (data.table)
library(readr)

Sys.setlocale("LC_ALL", "Ukrainian")

# Функція для скачування даних
get_komitet <- function(){
  # Унікальні ID комітетів
  comit_id <- c(3002, 3003, 3004, 3005, 3006, 3007, 3008, 3009, 3010, 3293, 3012, 3013, 
                 3014,3015,3016,3017,3018,3019,3020,3021, 3022,3023, 3024)
  
  for(i in comit_id) {
    
    url <- paste0("http://w1.c1.rada.gov.ua/pls/site2/p_komity_list?pidid=", i)
  
    url_table <- read_html(url, encoding = "Windows-1251")%>%
      html_table(fill = TRUE)
    
    # На основній сторінці нам треба таблиця №1
    results <- url_table[[1]]
    
    # Збираємо назву Комітету над табличкою
    name <- read_html(url, encoding = "Windows-1251") %>%
      html_node(".information_block h3") %>%
      html_text(trim = TRUE)
    
    # Додаємо нову колонку з назвою комітету в основну таблицю
    results$name <- name
    
    # Зберігаємо дані в таблицю
    write.table(results,
                paste0("members_komit_09_",  Sys.Date(),".csv"), 
                append = TRUE, col.names = FALSE, 
                row.names = FALSE, sep = ";")
    message(paste(i, '_downloaded'))
    
    Sys.sleep(0.3)
    }
}

komitety <- get_komitet()

# Імпортуємо завантажені дані в R
# Увага: у нас не завжди кіклькість нардепів серед членів комітетів буде дорівнювати кількості чинних нардепів
# Оскільки є нардепи, які не входять в жоден комітетів 
# Насамперед йдеться про керівництво ВРУ, але є також і рядові нардепи, яких обрали пізніше, але ВРУ ще не направила їх в комітети 
membership_k <- read.csv("members_komit_09_2021-06-04.csv", header = FALSE) %>% 
  rename("full_name_k"=V1, 
         "position_k"=V2,
         "department_k"=V3)

# Short names of committees 
membership_k_short <- membership_k %>%  # 
  mutate(department_k = recode(department_k, 
                             "Комітет з питань прав людини, деокупації та реінтеграції тимчасово окупованих територій у Донецькій, Луганській областях та Автономної Республіки Крим, міста Севастополя, національних меншин і міжнаціональних відносин" = "Прав людини, деокупації",
                            
                             "Комітет з питань організації державної влади, місцевого самоврядування, регіонального розвитку та містобудування" = "Держвлади і самоврядування",
                             "Комітет з питань Регламенту, депутатської етики та організації роботи Верховної Ради України" = "Регламентний комітет",
                             "Комітет з питань соціальної політики та захисту прав ветеранів" = "Соцполітика і захист ветеранів",
                             "Комітет з питань інтеграції України до Європейського Союзу" = "Інтеграція з ЄС",
                             
                             "Комітет з питань зовнішньої політики та міжпарламентського співробітництва"="Зовнішня політика",
                             "Комітет з питань енергетики та житлово-комунальних послуг"="Енергетика і ЖКГ",
                             "Комітет з питань здоров'я нації, медичної допомоги та медичного страхування"="Медичний комітет",
                             "Комітет з питань національної безпеки, оборони та розвідки"="Нацбезпеки і оборони",
                             "Комітет з питань екологічної політики та природокористування"="Екологія і природа",
                             "Комітет з питань антикорупційної політики"="Антикорупційний комітет",
                             "Комітет з питань гуманітарної та інформаційної політики"="Гуманітарна і інформполітика",
                             "Комітет з питань транспорту та інфраструктури"="Транспорт і інфраструктура",
                             "Комітет з питань освіти, науки та інновацій"="Освіта і наука",
                             "Комітет з питань аграрної та земельної політики"="Аграрний комітет",
                             "Комітет з питань фінансів, податкової та митної політики"="Фінанси і податки",
                             "Комітет з питань правоохоронної діяльності"="Правоохоронний",
                             "Комітет з питань економічного розвитку"="Економрозвиток",
                             "Комітет з питань бюджету"="Бюджетний комітет",
                             "Комітет з питань правової політики"="Правова політика",
                             "Комітет з питань цифрової трансформації"="Цифрова трансформація",
                             "Комітет з питань молоді і спорту"="Молоді та спорту")
  )


